In [1]:
import pandas as pd
import xlrd
url = r"salaries.xlsx"
df = pd.read_excel(url,sheet_name = "Sheet1")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     13 non-null     object
 1   Salary   13 non-null     int64
 2   Country  13 non-null     object
dtypes: int64(1), object(2)
memory usage: 440.0+ bytes

In [2]:
df["Salary"].mean()

54230.769230769234

In [3]:
df["Salary"].max()

81000

In [4]:
df.Salary.min()

32000

In [5]:
df.Salary.count()

13

In [6]:
df.Salary.std()

14827.64223870317

In [9]:
x = df.Country.unique()
type(x)

numpy.ndarray

In [10]:
x

array(['USA', 'Brazil', 'Germany', 'UK'], dtype=object)

In [11]:
list(x)

['USA', 'Brazil', 'Germany', 'UK']

In [12]:
len(x)

4

In [14]:
df.Country.nunique()

4

In [19]:
df.Country.value_counts()

Country
USA        4
Brazil     3
Germany    3
UK         3
Name: count, dtype: int64

In [23]:
df[(df["Salary"] > 50000) & (df["Country"] == "UK")]

      Name  Salary Country
10    John   61000      UK
11  George   71000      UK

In [24]:
mask = (df["Salary"] > 50000) & (df["Country"] == "UK")
mask

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
12    False
dtype: bool

In [25]:
type(mask)

pandas.core.series.Series

In [26]:
df[mask]

      Name  Salary Country
10    John   61000      UK
11  George   71000      UK

In [29]:
df.sort_values("Salary",ascending = False)

         Name  Salary  Country
6      Eduard   81000  Germany
4        Mark   72000      USA
11     George   71000       UK
5         Dan   62000   Brazil
10       John   61000       UK
7       Julia   55000      USA
3       Diana   54000      USA
12     Oliver   49000       UK
9         Ben   48000   Brazil
2     Andreas   45000  Germany
0      Marry    40000      USA
8     Antonio   35000  Germany
1   Elizabeth   32000   Brazil

In [30]:
df.sort_values("Name")

         Name  Salary  Country
2     Andreas   45000  Germany
8     Antonio   35000  Germany
9         Ben   48000   Brazil
5         Dan   62000   Brazil
3       Diana   54000      USA
6      Eduard   81000  Germany
1   Elizabeth   32000   Brazil
11     George   71000       UK
10       John   61000       UK
7       Julia   55000      USA
4        Mark   72000      USA
0      Marry    40000      USA
12     Oliver   49000       UK

In [31]:
c = df.groupby("Country")

In [32]:
c

In [33]:
c.max()

              Name  Salary
Country
Brazil   Elizabeth   62000
Germany     Eduard   81000
UK          Oliver   71000
USA         Marry    72000

In [34]:
c.min()

            Name  Salary
Country
Brazil       Ben   32000
Germany  Andreas   35000
UK        George   49000
USA        Diana   40000

In [40]:
dir(c._DataFrameGroupBy__examples_dataframe_doc.)

'\n>>> df = pd.dataframe({\'a\' : [\'foo\', \'bar\', \'foo\', \'bar\',\n...                           \'foo\', \'bar\'],\n...                    \'b\' : [\'one\', \'one\', \'two\', \'three\',\n...                           \'two\', \'two\'],\n...                    \'c\' : [1, 5, 5, 2, 5, 5],\n...                    \'d\' : [2.0, 5., 8., 1., 2., 9.]})\n>>> grouped = df.groupby(\'a\')[[\'c\', \'d\']]\n>>> grouped.transform(lambda x: (x - x.mean()) / x.std())\n        c         d\n0 -1.154701 -0.577350\n1  0.577350  0.000000\n2  0.577350  1.154701\n3 -1.154701 -1.000000\n4  0.577350 -0.577350\n5  0.577350  1.000000\n\nbroadcast result of the transformation\n\n>>> grouped.transform(lambda x: x.max() - x.min())\n    c    d\n0  4.0  6.0\n1  3.0  8.0\n2  4.0  6.0\n3  3.0  8.0\n4  4.0  6.0\n5  3.0  8.0\n\n>>> grouped.transform("mean")\n    c    d\n0  3.666667  4.0\n1  4.000000  5.0\n2  3.666667  4.0\n3  4.000000  5.0\n4  3.666667  4.0\n5  4.000000  5.0\n\n.. versionchanged:: 1.3.0\n\nthe resulting dtype will reflect the return value of the passed ``func``,\nfor example:\n\n>>> grouped.transform(lambda x: x.astype(int).max())\nc  d\n0  5  8\n1  5  9\n2  5  8\n3  5  9\n4  5  8\n5  5  9\n'

In [44]:
df1 = c.max()

In [45]:
df1

              Name  Salary
Country
Brazil   Elizabeth   62000
Germany     Eduard   81000
UK          Oliver   71000
USA         Marry    72000

In [47]:
df1.loc["UK"]

Name      Oliver
Salary     71000
Name: UK, dtype: object

In [48]:
df

         Name  Salary  Country
0      Marry    40000      USA
1   Elizabeth   32000   Brazil
2     Andreas   45000  Germany
3       Diana   54000      USA
4        Mark   72000      USA
5         Dan   62000   Brazil
6      Eduard   81000  Germany
7       Julia   55000      USA
8     Antonio   35000  Germany
9         Ben   48000   Brazil
10       John   61000       UK
11     George   71000       UK
12     Oliver   49000       UK

In [49]:
df2 = c.min()

In [50]:
df2.loc["USA"]

Name      Diana
Salary    40000
Name: USA, dtype: object

In [52]:
df.groupby("Country").min().loc["USA"]

Name      Diana
Salary    40000
Name: USA, dtype: object

In [54]:
df3 = df.groupby("Country").describe()

In [55]:
type(df3)

pandas.core.frame.DataFrame

In [56]:
df.groupby("Country").describe().transpose()

Country             Brazil       Germany            UK           USA
Salary count      3.000000      3.000000      3.000000      4.000000
       mean   47333.333333  53666.666667  60333.333333  55250.000000
       std    15011.106999  24193.663082  11015.141095  13098.982149
       min    32000.000000  35000.000000  49000.000000  40000.000000
       25%    40000.000000  40000.000000  55000.000000  50500.000000
       50%    48000.000000  45000.000000  61000.000000  54500.000000
       75%    55000.000000  63000.000000  66000.000000  59250.000000
       max    62000.000000  81000.000000  71000.000000  72000.000000